Tekla.Structures.Analysis.Operations.Operation
Operations of analysis objects.

Tekla.Structures.Analysis.Operations.Operation.MoveObject(Tekla.Structures.Analysis.AnalysisObject,Tekla.Structures.Geometry3d.Vector)
Moves the analysis object by translation vector.
Supported objects are: AnalysisNode, AnalysisPart.
analysisObject: The analysis object to move.
translation: The vector for moving the object.
Returns: True on success, false on failure.

Tekla.Structures.Analysis.Operations.Operation.MoveAnalysisPartPosition(Tekla.Structures.Analysis.AnalysisPart,Tekla.Structures.Analysis.AnalysisNode,Tekla.Structures.Geometry3d.Vector)
Moves the analysis part position by translation vector.
Only the handle positions can be moved.
analysisPart: The analysis part.
node: The node.
translation: The vector for moving the position.
Returns: True on success, false on failure.

Tekla.Structures.Analysis.Operations.Operation.MoveAnalysisPartAreaEdge(Tekla.Structures.Analysis.AnalysisPart,Tekla.Structures.Analysis.AnalysisNode,Tekla.Structures.Analysis.AnalysisNode,Tekla.Structures.Geometry3d.Vector)
Moves the analysis part area edge by translation vector.
Perpendicular offset is calculated from the translation vector.
analysisPart: The analysis part.
edgeNode1: Edge node 1.
edgeNode2: Edge node 2.
translation: The vector for moving the edge.
Returns: True on success, false on failure.

Tekla.Structures.Analysis.Operations.Operation.ResetAnalysisPartPositions(Tekla.Structures.Analysis.AnalysisPart)
Reset analysis part. Removes the offsets applied to node positions.
The axis offset of the analysis part is not reset.
analysisPart: The analysis part.